spec/fixtures/vcr_cassettes/The_Checkout_Page_-_/I_can_create_a_new_order_after_checking_out.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_3p7gsRvIOULII6&email=guy%40example.com&description=%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20Name%3A%20.%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20Uploaded%20files%3A%20s3%3A%2F%2Factivid%2Fac075b778f1f627e82584e00a350305b%2F%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20Minutes%3A%20%23%3CVideoLength%3A0x00000004c2b9e8%3E%0A
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_aZs9IWK2fMnxQqgWCns8iIXW
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.10.1\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-linux\",\"publisher\":\"stripe\",\"uname\":\"Linux
        xxxg-sandrock 3.13.6-200.fc20.x86_64 #1 SMP Fri Mar 7 17:02:28 UTC 2014 x86_64
        x86_64 x86_64 GNU/Linux\"}"
      Content-Length:
      - '480'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 09 Apr 2014 21:40:42 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1493'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1397079642,
          "id": "cus_3p7gv9zoftmseU",
          "livemode": false,
          "description": "                              Name: .\n                              Uploaded files: s3://activid/ac075b778f1f627e82584e00a350305b/\n                              Minutes: #\u003CVideoLength:0x00000004c2b9e8\u003E\n",
          "email": "guy@example.com",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_3p7gv9zoftmseU/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_3p7gv9zoftmseU/cards",
            "data": [
              {
                "id": "card_3p7ghNlx4UGXMo",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 1,
                "exp_year": 2020,
                "fingerprint": "HTtdaqhN9cG2igMo",
                "customer": "cus_3p7gv9zoftmseU",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ],
            "count": 1
          },
          "default_card": "card_3p7ghNlx4UGXMo",
          "subscription": null
        }
    http_version: 
  recorded_at: Wed, 09 Apr 2014 21:40:42 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=9500&currency=usd&customer=cus_3p7gv9zoftmseU
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_aZs9IWK2fMnxQqgWCns8iIXW
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.10.1\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-linux\",\"publisher\":\"stripe\",\"uname\":\"Linux
        xxxg-sandrock 3.13.6-200.fc20.x86_64 #1 SMP Fri Mar 7 17:02:28 UTC 2014 x86_64
        x86_64 x86_64 GNU/Linux\"}"
      Content-Length:
      - '52'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 09 Apr 2014 21:40:43 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1003'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_3p7gOjJxJSC6NX",
          "object": "charge",
          "created": 1397079643,
          "livemode": false,
          "paid": true,
          "amount": 9500,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_3p7ghNlx4UGXMo",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 1,
            "exp_year": 2020,
            "fingerprint": "HTtdaqhN9cG2igMo",
            "customer": "cus_3p7gv9zoftmseU",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [],
          "balance_transaction": "txn_3p7gbfSQq2YQaC",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_3p7gv9zoftmseU",
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_description": null
        }
    http_version: 
  recorded_at: Wed, 09 Apr 2014 21:40:43 GMT
recorded_with: VCR 2.8.0
